app/controllers/reservations_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reservations" ("book_id", "created_at", "email", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["created_at", Tue, 03 Apr 2012 13:35:49 UTC +00:00], ["email", "library@eficode.com"], ["state", "reserved"], ["updated_at", Tue, 03 Apr 2012 13:35:49 UTC +00:00]]
---
  def create
    @book = Book.find(params[:book_id])
	@user = current_user_id
    @reservation = @book.reservations.new(params[:reservation])
    if @reservation.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."book_id" = 2 AND "reservations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def free
    @book = Book.find(params[:book_id])
	@user = current_user_id
    @reservation = @book.reservations.find(params[:id])